# Pandas Practice

In [2]:
import pandas as pd
import os

### Pandas 2 Main DataTypes
* Series --> 1 Dimensional
* DataFrame --> 2 Dimensional --> Python Dictionary

In [3]:
# Series
car_model = pd.Series(["BMW", "Toyota", "Honda"])
car_model

0       BMW
1    Toyota
2     Honda
dtype: object

In [4]:
# Series
car_color = pd.Series(["Red", "Blue", "White"])
car_color

0      Red
1     Blue
2    White
dtype: object

In [5]:
# Data Frame
car_data = pd.DataFrame({"Car":car_model, "Color":car_color})
car_data

      Car  Color
0     BMW    Red
1  Toyota   Blue
2   Honda  White

## Importing Data using "read_csv"

In [6]:
# get current working directory
current_dir = os.getcwd()

#Project Directory
project_dir = os.path.abspath(os.path.join(current_dir, '..', '..', '..'))

#construct the path
file_path = os.path.join(project_dir, 'data','car-sales.csv')

car_sales = pd.read_csv(file_path)
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

# Describing Data

In [7]:
# Attribute (dtypes)
car_sales.dtypes

Make             object
Colour           object
Odometer (KM)     int64
Doors             int64
Price            object
dtype: object

In [8]:
car_sales.columns

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [9]:
car_columns = car_sales.columns
car_columns

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [10]:
car_sales.index

RangeIndex(start=0, stop=10, step=1)

In [11]:
# describe() gives statistical information
# describe() works on only numeric columns
car_sales.describe()

       Odometer (KM)      Doors
count      10.000000  10.000000
mean    78601.400000   4.000000
std     61983.471735   0.471405
min     11179.000000   3.000000
25%     35836.250000   4.000000
50%     57369.000000   4.000000
75%     96384.500000   4.000000
max    213095.000000   5.000000

In [12]:
car_sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Make           10 non-null     object
 1   Colour         10 non-null     object
 2   Odometer (KM)  10 non-null     int64
 3   Doors          10 non-null     int64
 4   Price          10 non-null     object
dtypes: int64(2), object(3)
memory usage: 532.0+ bytes

In [13]:
car_sales.describe().mean()

Odometer (KM)    69307.327717
Doors                4.308926
dtype: float64

In [14]:
car_sales.sum()

Make             ToyotaHondaToyotaBMWNissanToyotaHondaHondaToyo...
Colour               WhiteRedBlueBlackWhiteGreenBlueBlueWhiteWhite
Odometer (KM)                                               786014
Doors                                                           40
Price            $4,000.00$5,000.00$7,000.00$22,000.00$3,500.00...
dtype: object

In [15]:
car_sales.describe().sum()

Odometer (KM)    554458.621735
Doors                34.471405
dtype: float64

In [16]:
car_sales["Doors"].sum()

40

In [17]:
len(car_sales)

10

# Viewing and Selecting Data

In [18]:
# head() gives a quick snapshot of the dataframe
# first 5 rows
car_sales.head()

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00

In [19]:
car_sales.head(3)

     Make Colour  Odometer (KM)  Doors      Price
0  Toyota  White         150043      4  $4,000.00
1   Honda    Red          87899      4  $5,000.00
2  Toyota   Blue          32549      3  $7,000.00

In [20]:
# tail() gives the bottom 5 rows or last 5 rows of the dataframe
car_sales.tail()

     Make Colour  Odometer (KM)  Doors      Price
5  Toyota  Green          99213      4  $4,500.00
6   Honda   Blue          45698      4  $7,500.00
7   Honda   Blue          54738      4  $7,000.00
8  Toyota  White          60000      4  $6,250.00
9  Nissan  White          31600      4  $9,700.00

In [21]:
car_sales.tail(2)

     Make Colour  Odometer (KM)  Doors      Price
8  Toyota  White          60000      4  $6,250.00
9  Nissan  White          31600      4  $9,700.00

In [22]:
# .loc and .iloc
animals = pd.Series(["cat", "dog", "bird", "fish", "snake", "pandas"], index=[0,1,3,3,2,5])
animals

0       cat
1       dog
3      bird
3      fish
2     snake
5    pandas
dtype: object

In [23]:
# .loc refers to index
animals.loc[1]

'dog'

In [24]:
# .loc refers to index
animals.loc[3]

3    bird
3    fish
dtype: object

In [25]:
# .iloc refers to position
animals.iloc[3]

'fish'

In [26]:
car_sales.loc[1]

Make                 Honda
Colour                 Red
Odometer (KM)        87899
Doors                    4
Price            $5,000.00
Name: 1, dtype: object

In [27]:
animals

0       cat
1       dog
3      bird
3      fish
2     snake
5    pandas
dtype: object

In [28]:
# Slicing
animals.iloc[:3]

0     cat
1     dog
3    bird
dtype: object

In [29]:
animals.loc[:3]

0     cat
1     dog
3    bird
3    fish
dtype: object

In [30]:
# Accessing Columns
car_sales["Make"]

0    Toyota
1     Honda
2    Toyota
3       BMW
4    Nissan
5    Toyota
6     Honda
7     Honda
8    Toyota
9    Nissan
Name: Make, dtype: object

In [31]:
car_sales.Make

0    Toyota
1     Honda
2    Toyota
3       BMW
4    Nissan
5    Toyota
6     Honda
7     Honda
8    Toyota
9    Nissan
Name: Make, dtype: object

In [32]:
# filtering
car_sales[car_sales["Make"] == "Toyota"]

     Make Colour  Odometer (KM)  Doors      Price
0  Toyota  White         150043      4  $4,000.00
2  Toyota   Blue          32549      3  $7,000.00
5  Toyota  Green          99213      4  $4,500.00
8  Toyota  White          60000      4  $6,250.00

In [33]:
car_sales[car_sales["Odometer (KM)"] > 150000]

     Make Colour  Odometer (KM)  Doors      Price
0  Toyota  White         150043      4  $4,000.00
4  Nissan  White         213095      4  $3,500.00

In [34]:
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [35]:
# crosstab
cross_doors = pd.crosstab(car_sales["Make"], car_sales["Doors"])
cross_doors

Doors   3  4  5
Make
BMW     0  0  1
Honda   0  3  0
Nissan  0  2  0
Toyota  1  3  0

In [36]:
cross_colour = pd.crosstab(car_sales["Make"], car_sales["Colour"])
cross_colour

Colour  Black  Blue  Green  Red  White
Make
BMW         1     0      0    0      0
Honda       0     2      0    1      0
Nissan      0     0      0    0      2
Toyota      0     1      1    0      2

In [41]:
# groupby()
numeric_columns = ["Odometer (KM)", "Doors"]
car_sales.groupby("Make")[numeric_columns].mean()

        Odometer (KM)  Doors
Make
BMW      11179.000000   5.00
Honda    62778.333333   4.00
Nissan  122347.500000   4.00
Toyota   85451.250000   3.75

In [53]:
car_sales["Price"] = car_sales["Price"].str.replace('[\$,]', '', regex=True).astype(float)
car_sales

<>:1: SyntaxWarning: invalid escape sequence '\$'
<>:1: SyntaxWarning: invalid escape sequence '\$'
C:\Users\User\AppData\Local\Temp\ipykernel_9020\409848989.py:1: SyntaxWarning: invalid escape sequence '\$'
  car_sales["Price"] = car_sales["Price"].str.replace('[\$\,]', '', regex=True).astype(float)
C:\Users\User\AppData\Local\Temp\ipykernel_9020\409848989.py:1: SyntaxWarning: invalid escape sequence '\$'
  car_sales["Price"] = car_sales["Price"].str.replace('[\$\,]', '', regex=True).astype(float)

AttributeError: Can only use .str accessor with string values!